# IdeaStatiCa.ConnectionApi.Model.ConCssLineSegment

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Start** | **ConCssPoint2D** |  | [optional]
**End** | **ConCssPoint2D** |  | [optional]
**Type** | **string** |  | [default to "IdeaStatiCa.Api.Connection.Model.Material.ConCssLineSegment, IdeaStatiCa.Api"]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)